import { StaticImageData } from 'next/image';

import services_01 from '@/images/services/services_01.jpg';
import services_02 from '@/images/services/services_02.jpg';
import services_03 from '@/images/services/services_03.jpg';
import services_04 from '@/images/services/services_04.jpg';

interface DataInterface {
  id: string;
  // icon: TypeLucideIcon;
  title: string;
  description: string;
  points: string[];
  src: StaticImageData;
}

export const servicesData: DataInterface[] = [
  {
    id: '1',
    title: 'Адміністрування серверів',
    description:
      'Адміністрування серверів включає комплексну підтримку і управління серверною інфраструктурою для забезпечення безперебійної роботи бізнесу, адаптуючи рішення під ваші потреби.',
    points: [
      'Моніторинг та аналіз роботи серверів для своєчасного виявлення і вирішення проблем',
      'Встановлення та оновлення серверного програмного забезпечення для підтримання оптимальної продуктивності',
      'Налаштування безпеки серверів, включаючи управління доступом і захист від шкідливого програмного забезпечення',
    ],
    src: services_01,
  },
  {
    id: '2',
    title: 'Системне адміністрування',
    description:
      'Послуга забезпечує ефективне управління та підтримку всіх інформаційних технологій вашого бізнесу. Наша команда фахівців гарантує безперебійну роботу ІТ-систем, швидке вирішення проблем та оптимізацію процесів.',
    points: [
      'Встановлення та налаштування апаратного і програмного забезпечення для забезпечення стабільної роботи',
      'Управління мережевою інфраструктурою для безперебійного обміну даними між усіма підрозділами',
      'Налагодження і підтримка засобів безпеки, включаючи антивірусний захист та контроль доступу',
    ],
    src: services_02,
  },
  {
    id: '3',
    title: 'Технічна підтримка',
    description:
      'Технічна підтримка користувачів спрямована на швидке і ефективне вирішення ІТ-проблем, з якими стикаються ваші співробітники. Наші фахівці завжди готові надати допомогу, забезпечуючи безперебійну роботу.',
    points: [
      'Вирішення технічних проблем у режимі реального часу через телефон, електронну пошту або віддалений доступ',
      'Налаштування і підтримка робочих станцій, включаючи встановлення необхідного програмного забезпечення',
      'Виявлення і усунення проблем з підключенням до мережі та інтернету для забезпечення доступу до ресурсів компанії',
    ],
    src: services_03,
  },
  {
    id: '4',
    title: 'Закупівля та налаштування',
    description:
      'Послуга забезпечує оптимальний вибір і ефективне впровадження технічних рішень для вашого бізнесу. Наші експерти надають консультації щодо вибору, придбання та налаштування обладнання, що відповідає вашим потребам.',
    points: [
      'Консультації з вибору ІТ-обладнання, враховуючи специфіку вашого бізнесу і вимоги',
      'Організація та проведення процесу закупівлі, включаючи переговори з постачальниками і оцінку пропозицій',
      'Налаштування нового обладнання, включаючи встановлення програмного забезпечення і підключення до мережі',
    ],
    src: services_04,
  },
];

export const content = {
  title: 'Наші послуги',
  servicesData,
  watchMore: 'Дізнатись більше',
  goToAllSevices: 'Переглянути всі послуги',
};
