interface DataInterface {
  id: string;
  title: string;
  description: string;
}

export const FAQData: DataInterface[] = [
  {
    id: '1',
    title: "Скільки коштує обслуговування комп'ютерів",
    description:
      'Якщо Вам необхідна лише підтримка робочих станцій —ціна може обговорюватися. Для кожної організації остаточну вартість буде озвучено після проведення безкоштовного ІТ аудиту',
  },
  {
    id: '2',
    title: 'Якщо я не хочу укладати договір?',
    description:
      "Працюємо тільки з юридичними особами. Навіть якщо потрібно виконати разову роботу — укладаємо договір на виконання разових робіт, в якому прописуємо свої права та обов/'язки.",
  },
  {
    id: '3',
    title: "Як зв'язатися з техпідтримкою у вихідний день або неробочий час?",
    description:
      "У всіх тарифних планах передбачена цілодобова підтримка, пов'язана з питаннями роботи на сервері або підключення до нього.  Безкоштовний виїзд у неробочий час можливий за попередньою домовленістю.  Деякі роботи ми виконуємо саме в неробочий час, щоб не відволікати ваших співробітників. ",
  },
  {
    id: '4',
    title: 'Скільки разів на тиждень сисадмін буде в нашому офісі?',
    description:
      "Кількість обов'язкових виїздів прописується в договорі.  Як показує практика, на перших порах ви нас будете бачити досить часто. Це етап первинного налаштування і приведення ІТ-інфраструктури до ладу.  Потім усе рідше. Виїжджаємо за наявності заявки з вашого боку, але намагаємося не відволікати своєю присутністю без необхідності. Утім, на каву або на підписання документів будемо приїжджати",
  },
  {
    id: '5',
    title: 'Скільки коштують послуги сисадміна погодинно?',
    description:
      'Ми практикуємо не погодинну оплату, а оплату за виконані послуги.  Зазвичай ще в телефонному режимі озвучуємо вартість.  Якщо завдання нестандартне — беремо з розрахунку:  Перша година — 600 грн/год, наступні — 300 грн/год.  Мінімальна оплата — як за одну годину. Оплата проводиться тільки за виконану роботу і не може бути змінена без узгодження із замовником ',
  },
  {
    id: '6',
    title: 'Що таке DNS і як він працює?',
    description:
      "DNS (Domain Name System) – це система, яка переводить доменні імена (наприклад, www.example.com) у IP-адреси, які використовуються для ідентифікації пристроїв у мережі. Коли ви вводите доменне ім'я у браузер, DNS-сервери виконують пошук відповідної IP-адреси, дозволяючи вашому пристрою з'єднатися з правильним сервером.",
  },
  {
    id: '7',
    title: "Як перевірити з'єднання з сервером?",
    description:
      "Для перевірки з'єднання з сервером можна використовувати команду ping. Введіть ping [IP-адреса або доменне ім'я сервера] у командному рядку. Це відправить кілька пакетів на сервер і поверне час відповіді, що дозволить вам визначити, чи сервер доступний.",
  },
  {
    id: '8',
    title: 'Що таке виртуалізація',
    description:
      'Віртуалізація – це технологія, яка дозволяє створювати віртуальні версії фізичних компонентів, таких як сервери, сховища і мережеві ресурси.',
  },
  {
    id: '9',
    title: 'Яка різниця між TCP і UDP?',
    description:
      "TCP (Transmission Control Protocol) – це протокол, який забезпечує надійну передачу даних із встановленням з'єднання та контролем цілісності. UDP (User Datagram Protocol) – це протокол без встановлення з'єднання, який передає дані без перевірки їхньої цілісності та без підтвердження доставки, що робить його швидшим, але менш надійним.",
  },
];
